tests/api_response_mocks/create_and_pay_subscription_success_190.json

{
   "Transaction": {
      "Key": "723AE30D9C234A0B869E1E881832xxxx",
      "Invoice": "testsub1",
      "ServiceCode": "ideal",
      "Status": {
         "Code": {
            "Code": 190,
            "Description": "Success"
         },
         "SubCode": {
            "Code": "S001",
            "Description": "Transaction successfully processed"
         },
         "DateTime": "2017-08-03T10:29:23"
      },
      "IsTest": true,
      "Order": null,
      "Currency": "EUR",
      "AmountDebit": 10,
      "TransactionType": "C021",
      "Services": [
         {
            "Name": "Subscriptions",
            "Action": null,
            "Parameters": [
               {
                  "Name": "SubscriptionGuid",
                  "Value": "7E1B40A25F194D7CA0358A05B83Dxxxx"
               },
               {
                  "Name": "Subscription_RatePlanGuid_gvn1fxxx",
                  "Value": "CBC6ECF6BD9843D39A347E46C8CBxxxx"
               },
               {
                  "Name": "Subscription_RatePlanChargeGuid_at4hbxxx",
                  "Value": "AC941EE042684F5882AA5563720Exxxx"
               },
               {
                  "Name": "Subscription_RatePlanChargeGuid_trwhhxxx",
                  "Value": "6E759FAB0F2A40439B03B2A43314xxxx"
               }
            ],
            "VersionAsProperty": 1
         },
         {
            "Name": "ideal",
            "Action": null,
            "Parameters": [
               {
                  "Name": "consumerIssuer",
                  "Value": "ABN Amro"
               },
               {
                  "Name": "transactionId",
                  "Value": "0000000000000001"
               },
               {
                  "Name": "consumerName",
                  "Value": "J. de Tèster"
               },
               {
                  "Name": "consumerIBAN",
                  "Value": "NL44RABO0123456789"
               },
               {
                  "Name": "consumerBIC",
                  "Value": "RABONL2U"
               }
            ],
            "VersionAsProperty": 2
         }
      ],
      "CustomParameters": null,
      "AdditionalParameters": null,
      "MutationType": 1,
      "RelatedTransactions": null,
      "IsCancelable": false,
      "IssuingCountry": null,
      "StartRecurrent": true,
      "Recurring": false,
      "CustomerName": "J. de Tèster",
      "PayerHash": "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
      "PaymentKey": "B42F96DD9E9A473495171B0E9201xxxx"
   }
}